{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "model_2", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "name": "input_3"}, "registered_name": null, "name": "input_3", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_188", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 299, 299, 3]}, "name": "conv2d_188", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 299, 299, 3], "dtype": "float32", "keras_history": ["input_3", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_188", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 149, 149, 32]}, "name": "batch_normalization_188", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 149, 149, 32], "dtype": "float32", "keras_history": ["conv2d_188", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_188", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 149, 149, 32]}, "name": "activation_188", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 149, 149, 32], "dtype": "float32", "keras_history": ["batch_normalization_188", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_189", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 149, 149, 32]}, "name": "conv2d_189", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 149, 149, 32], "dtype": "float32", "keras_history": ["activation_188", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_189", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 147, 147, 32]}, "name": "batch_normalization_189", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 147, 147, 32], "dtype": "float32", "keras_history": ["conv2d_189", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_189", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 147, 147, 32]}, "name": "activation_189", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 147, 147, 32], "dtype": "float32", "keras_history": ["batch_normalization_189", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_190", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 147, 147, 32]}, "name": "conv2d_190", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 147, 147, 32], "dtype": "float32", "keras_history": ["activation_189", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_190", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 147, 147, 64]}, "name": "batch_normalization_190", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 147, 147, 64], "dtype": "float32", "keras_history": ["conv2d_190", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_190", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 147, 147, 64]}, "name": "activation_190", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 147, 147, 64], "dtype": "float32", "keras_history": ["batch_normalization_190", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "trainable": false, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 147, 147, 64]}, "name": "max_pooling2d_8", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 147, 147, 64], "dtype": "float32", "keras_history": ["activation_190", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_191", "trainable": false, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 73, 73, 64]}, "name": "conv2d_191", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 73, 73, 64], "dtype": "float32", "keras_history": ["max_pooling2d_8", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_191", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 73, 73, 80]}, "name": "batch_normalization_191", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 73, 73, 80], "dtype": "float32", "keras_history": ["conv2d_191", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_191", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 73, 73, 80]}, "name": "activation_191", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 73, 73, 80], "dtype": "float32", "keras_history": ["batch_normalization_191", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_192", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 73, 73, 80]}, "name": "conv2d_192", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 73, 73, 80], "dtype": "float32", "keras_history": ["activation_191", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_192", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 71, 71, 192]}, "name": "batch_normalization_192", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 71, 71, 192], "dtype": "float32", "keras_history": ["conv2d_192", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_192", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 71, 71, 192]}, "name": "activation_192", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 71, 71, 192], "dtype": "float32", "keras_history": ["batch_normalization_192", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": false, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 71, 71, 192]}, "name": "max_pooling2d_9", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 71, 71, 192], "dtype": "float32", "keras_history": ["activation_192", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_196", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 192]}, "name": "conv2d_196", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 192], "dtype": "float32", "keras_history": ["max_pooling2d_9", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_196", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 64]}, "name": "batch_normalization_196", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 64], "dtype": "float32", "keras_history": ["conv2d_196", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_196", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 64]}, "name": "activation_196", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 64], "dtype": "float32", "keras_history": ["batch_normalization_196", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_194", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 192]}, "name": "conv2d_194", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 192], "dtype": "float32", "keras_history": ["max_pooling2d_9", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_197", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 64]}, "name": "conv2d_197", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 64], "dtype": "float32", "keras_history": ["activation_196", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_194", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 48]}, "name": "batch_normalization_194", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 48], "dtype": "float32", "keras_history": ["conv2d_194", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_197", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 96]}, "name": "batch_normalization_197", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 96], "dtype": "float32", "keras_history": ["conv2d_197", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_194", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 48]}, "name": "activation_194", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 48], "dtype": "float32", "keras_history": ["batch_normalization_194", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_197", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 96]}, "name": "activation_197", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 96], "dtype": "float32", "keras_history": ["batch_normalization_197", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_18", "trainable": false, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 192]}, "name": "average_pooling2d_18", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 192], "dtype": "float32", "keras_history": ["max_pooling2d_9", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_193", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 192]}, "name": "conv2d_193", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 192], "dtype": "float32", "keras_history": ["max_pooling2d_9", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_195", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 48]}, "name": "conv2d_195", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 48], "dtype": "float32", "keras_history": ["activation_194", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_198", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 96]}, "name": "conv2d_198", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 96], "dtype": "float32", "keras_history": ["activation_197", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_199", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 192]}, "name": "conv2d_199", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 192], "dtype": "float32", "keras_history": ["average_pooling2d_18", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_193", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 64]}, "name": "batch_normalization_193", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 64], "dtype": "float32", "keras_history": ["conv2d_193", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_195", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 64]}, "name": "batch_normalization_195", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 64], "dtype": "float32", "keras_history": ["conv2d_195", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_198", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 96]}, "name": "batch_normalization_198", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 96], "dtype": "float32", "keras_history": ["conv2d_198", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_199", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 32]}, "name": "batch_normalization_199", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 32], "dtype": "float32", "keras_history": ["conv2d_199", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_193", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 64]}, "name": "activation_193", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 64], "dtype": "float32", "keras_history": ["batch_normalization_193", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_195", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 64]}, "name": "activation_195", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 64], "dtype": "float32", "keras_history": ["batch_normalization_195", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_198", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 96]}, "name": "activation_198", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 96], "dtype": "float32", "keras_history": ["batch_normalization_198", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_199", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 32]}, "name": "activation_199", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 32], "dtype": "float32", "keras_history": ["batch_normalization_199", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "mixed0", "trainable": false, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 35, 35, 64], [null, 35, 35, 64], [null, 35, 35, 96], [null, 35, 35, 32]]}, "name": "mixed0", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 64], "dtype": "float32", "keras_history": ["activation_193", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 64], "dtype": "float32", "keras_history": ["activation_195", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 96], "dtype": "float32", "keras_history": ["activation_198", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 32], "dtype": "float32", "keras_history": ["activation_199", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_203", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 256]}, "name": "conv2d_203", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 256], "dtype": "float32", "keras_history": ["mixed0", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_203", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 64]}, "name": "batch_normalization_203", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 64], "dtype": "float32", "keras_history": ["conv2d_203", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_203", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 64]}, "name": "activation_203", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 64], "dtype": "float32", "keras_history": ["batch_normalization_203", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_201", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 256]}, "name": "conv2d_201", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 256], "dtype": "float32", "keras_history": ["mixed0", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_204", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 64]}, "name": "conv2d_204", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 64], "dtype": "float32", "keras_history": ["activation_203", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_201", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 48]}, "name": "batch_normalization_201", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 48], "dtype": "float32", "keras_history": ["conv2d_201", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_204", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 96]}, "name": "batch_normalization_204", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 96], "dtype": "float32", "keras_history": ["conv2d_204", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_201", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 48]}, "name": "activation_201", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 48], "dtype": "float32", "keras_history": ["batch_normalization_201", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_204", "trainable": false, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 96]}, "name": "activation_204", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 96], "dtype": "float32", "keras_history": ["batch_normalization_204", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_19", "trainable": false, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 256]}, "name": "average_pooling2d_19", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 256], "dtype": "float32", "keras_history": ["mixed0", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_200", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 256]}, "name": "conv2d_200", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 256], "dtype": "float32", "keras_history": ["mixed0", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_202", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 48]}, "name": "conv2d_202", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 48], "dtype": "float32", "keras_history": ["activation_201", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_205", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 96]}, "name": "conv2d_205", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 96], "dtype": "float32", "keras_history": ["activation_204", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_206", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 256]}, "name": "conv2d_206", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 256], "dtype": "float32", "keras_history": ["average_pooling2d_19", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_200", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 64]}, "name": "batch_normalization_200", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 64], "dtype": "float32", "keras_history": ["conv2d_200", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_202", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 64]}, "name": "batch_normalization_202", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 64], "dtype": "float32", "keras_history": ["conv2d_202", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_205", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 35, 35, 96]}, "name": "batch_normalization_205", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 35, 35, 96], "dtype": "float32", "keras_history": ["conv2d_205", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_206", "trainable": false, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": 